IDENTIFICATION DIVISION.
PROGRAM-ID. AGEELIG.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 CUSTOMER-AGE PIC 99.
01 MIN-AGE PIC 99 VALUE 18.
PROCEDURE DIVISION.

DISPLAY "ENTER CUSTOMER AGE: "
ACCEPT CUSTOMER-AGE.

IF CUSTOMER-AGE >= MIN-AGE
  DISPLAY "CUSTOMER IS ELIGIBLE"
ELSE
  DISPLAY "CUSTOMER IS NOT ELIGIBLE"
END-IF.

STOP RUN.