>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. DEPOSIT.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 CURRENT-BALANCE   PIC 9(7).
01 DEPOSIT-AMOUNT    PIC 9(7).
01 UPDATED-BALANCE   PIC 9(7).

PROCEDURE DIVISION.
    DISPLAY "ENTER CURRENT BALANCE: ".
    ACCEPT CURRENT-BALANCE.

    DISPLAY "ENTER DEPOSIT AMOUNT: ".
    ACCEPT DEPOSIT-AMOUNT.

    IF DEPOSIT-AMOUNT > 0
        COMPUTE UPDATED-BALANCE = CURRENT-BALANCE + DEPOSIT-AMOUNT
        DISPLAY "Updated Balance = " UPDATED-BALANCE
    ELSE
        DISPLAY "Invalid deposit amount"
    END-IF.

    STOP RUN.
