IDENTIFICATION DIVISION.
PROGRAM-ID. MINBAL.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ACCOUNT-BALANCE PIC 9(5).
01 MIN-BALANCE PIC 9(5) VALUE 1000.

PROCEDURE DIVISION.

DISPLAY "ENTER ACCOUNT BALANCE: ".
ACCEPT ACCOUNT-BALANCE.

IF ACCOUNT-BALANCE >= MIN-BALANCE
  DISPLAY "Minimum balance maintained"
  
ELSE
  DISPLAY "Minimum balance not maintained"
  
END-IF.

STOP RUN.