IDENTIFICATION DIVISION.
PROGRAM-ID. CELSIUS-TO-F.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 C PIC 9(3).
01 F PIC 9(3)V9.
PROCEDURE DIVISION.
    DISPLAY "ENTER CELSIUS: ".
    ACCEPT C.
    COMPUTE F = (C * 9 / 5) + 32.
    DISPLAY "FAHRENHEIT: " F.
    STOP RUN.