IDENTIFICATION DIVISION.
PROGRAM-ID. LARGEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9(3).
01 B PIC 9(3).
01 C PIC 9(3).
PROCEDURE DIVISION.
    ACCEPT A B C.
    IF A > B AND A > C
        DISPLAY "A IS LARGEST"
    ELSE IF B > C
        DISPLAY "B IS LARGEST"
    ELSE
        DISPLAY "C IS LARGEST"
    END-IF.
    STOP RUN.
