IDENTIFICATION DIVISION.
PROGRAM-ID. GRADE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 M PIC 9(3).
PROCEDURE DIVISION.
    ACCEPT M.
    IF M >= 90
        DISPLAY "GRADE A"
    ELSE IF M >= 80
        DISPLAY "GRADE B"
    ELSE IF M >= 70
        DISPLAY "GRADE C"
    ELSE IF M >= 60
        DISPLAY "GRADE D"
    ELSE
        DISPLAY "GRADE F"
    END-IF.
    STOP RUN.
