IDENTIFICATION DIVISION.
PROGRAM-ID. BUBBLE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 ARR OCCURS 5 TIMES PIC 9(3).
01 I PIC 9.
01 J PIC 9.
01 TEMP PIC 9(3).
PROCEDURE DIVISION.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
        ACCEPT ARR(I)
    END-PERFORM.

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
        PERFORM VARYING J FROM I BY 1 UNTIL J > 5
            IF ARR(I) > ARR(J)
                MOVE ARR(I) TO TEMP
                MOVE ARR(J) TO ARR(I)
                MOVE TEMP TO ARR(J)
            END-IF
        END-PERFORM
    END-PERFORM.

    DISPLAY ARR.
    STOP RUN.
