IDENTIFICATION DIVISION.
PROGRAM-ID. CONCAT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC X(20).
01 B PIC X(20).
01 C PIC X(40).
PROCEDURE DIVISION.
    ACCEPT A B.
    STRING A B INTO C.
    DISPLAY "RESULT: " C.
    DISPLAY "LENGTH: " FUNCTION LENGTH(C).
    STOP RUN.
