IDENTIFICATION DIVISION.
PROGRAM-ID. FACTORIAL.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N PIC 9(2).
01 I PIC 9(2).
01 FACT PIC 9(6) VALUE 1.
PROCEDURE DIVISION.
    ACCEPT N.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > N
        COMPUTE FACT = FACT * I
    END-PERFORM.
    DISPLAY "FACTORIAL = " FACT.
    STOP RUN.
