IDENTIFICATION DIVISION.
PROGRAM-ID. PRIME.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N PIC 9(3).
01 I PIC 9(3).
01 FLAG PIC 9.
PROCEDURE DIVISION.
    PERFORM VARYING N FROM 2 BY 1 UNTIL N > 200
        MOVE 1 TO FLAG
        PERFORM VARYING I FROM 2 BY 1 UNTIL I >= N
            IF FUNCTION MOD(N I) = 0
                MOVE 0 TO FLAG
            END-IF
        END-PERFORM
        IF FLAG = 1
            DISPLAY N
        END-IF
    END-PERFORM.
    STOP RUN.
