IDENTIFICATION DIVISION.
PROGRAM-ID. SIMPLE-INTEREST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 P PIC 9(5).
01 R PIC 9(2).
01 T PIC 9(2).
01 SI PIC 9(6).
PROCEDURE DIVISION.
    ACCEPT P R T.
    COMPUTE SI = (P * R * T) / 100.
    DISPLAY "SIMPLE INTEREST: " SI.
    STOP RUN.
