IDENTIFICATION DIVISION.
PROGRAM-ID. REVERSE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N PIC 9(5).
01 REV PIC 9(5) VALUE 0.
PROCEDURE DIVISION.
    ACCEPT N.
    PERFORM UNTIL N = 0
        COMPUTE REV = REV * 10 + FUNCTION MOD(N 10)
        COMPUTE N = N / 10
    END-PERFORM.
    DISPLAY "REVERSED = " REV.
    STOP RUN.
