IDENTIFICATION DIVISION.
PROGRAM-ID. CI.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 P PIC 9(5).
01 R PIC 9(2).
01 T PIC 9(2).
01 CI PIC 9(7).
PROCEDURE DIVISION.
    ACCEPT P R T.
    COMPUTE CI = P * ((1 + R / 100) ** T).
    DISPLAY "COMPOUND INTEREST: " CI.
    STOP RUN.
