IDENTIFICATION DIVISION.
PROGRAM-ID. SUM20.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 ARR OCCURS 20 TIMES PIC 9(3).
01 I PIC 9(2).
01 SUM PIC 9(5) VALUE 0.
PROCEDURE DIVISION.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 20
        ACCEPT ARR(I)
        COMPUTE SUM = SUM + ARR(I)
    END-PERFORM.
    DISPLAY "SUM = " SUM.
    STOP RUN.
